<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AccountsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {







        DB::statement("
                            INSERT INTO accounts (`code`, `company_id`, `name`, `category_id`, `Parent_ID`, `classification_id`, `order`, `active`, `archived`, `is_used_in_reports`, `created_by`, `updated_by`, `is_details`, `is_fixed_assets`, `CategoryTxt`, `Unit_description`) VALUES
('134', 1, 'مصروفات العدد والمهمات الاستهلاكية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 'أخرى', ''),
('712', 1, 'صحون سلفر ثمن كيلو', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('890', 1, 'منظومة كاميرات وملحقاتها', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('1838', 1, 'مصروفات الخبز العادي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'خبز', 'كيس'),
('1925', 1, 'مصروفات اللحوم الحمراء خروف', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('3190', 1, 'مصروفات مواد التنظيف', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('3595', 1, 'مرتب فراس التركي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('3642', 1, 'مصروف لمكافحة الافات', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('3941', 1, 'مصروف الكهرباء والمياه مستحق', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('4088', 1, 'مصروف القفازات', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'علبة'),
('4588', 1, 'مرتب عثمان النيجري', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('4603', 1, 'مصروفات اللحوم البيضاء المطبخ المركزي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('4940', 1, 'مصروفات الكاتشب', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'صندوق / جالون'),
('5723', 1, 'حامد الشويهدي / الانيا', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('6802', 1, 'مصروفات جبنة الشرائح', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'صندوق'),
('7161', 1, '0مرتب محمد المنفي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('7554', 1, 'مصروف ايجار مقر الشركة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('7811', 1, 'تكاليف شعار ماندو الجديد', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('7826', 1, 'حامد الشويهدي / الانيا مصيف نادي الرمال', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('8750', 1, 'مصروفات الشحمة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('9881', 1, 'تغليفات خارجية', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('10163', 1, 'مسحوبات من صافي الربح', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('10284', 1, 'مصروفات تبلة اعشاب', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'كيلو'),
('10339', 1, 'مصروفات تبلة الكنتاكي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'كيلو'),
('11121', 1, 'مصروف الكهرباء والديزل والمياة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('11203', 1, 'مصروف تسجيل وضرائب', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('11284', 1, 'مصروف الكهرباء والديزل مستحق', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, '', NULL),
('11312', 1, 'عهدة مدير المعمل', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('11339', 1, 'دين لمطعم بسمة بيروت', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('11566', 1, 'امصدق الورفلي / ماندو الجرابة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('11635', 1, 'الحاج حمد زغبية / الانيا النوفليين ', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('11771', 1, 'مصروفات صوص الساموراي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'كجم'),
('11941', 1, 'مصروف تغليفات سندوتشات ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'كجم'),
('12397', 1, 'تكاليف ايجار مطعم الانيا  النوفليين الجديد', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('12602', 1, 'الحاج حمد زغبية / الانيا', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('12849', 1, 'مصروف صيانة الصرف الصحي الرئيسي', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('13182', 1, 'احمد العسبلي / معمل حي الاندلس', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('13558', 1, 'مصروفات الفحم ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'محروقات', 'شوال'),
('14163', 1, 'ديون المخبز ', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('15218', 1, 'المستثمر - الحاج احمد زغبية', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('15277', 1, 'المرتبات 0', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('15361', 1, 'تكاليف تأسيس معمل حي الاندلس', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('15798', 1, 'السلف', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('16121', 1, 'مرتب عبدالرحمن المصري', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('16378', 1, 'مرتب حمزة الجعفري', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, '', NULL),
('17066', 1, 'تكاليف تصميم وديكور', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL);
        ");echo '55555555';





        DB::statement("
                            INSERT INTO accounts (`code`, `company_id`, `name`, `category_id`, `Parent_ID`, `classification_id`, `order`, `active`, `archived`, `is_used_in_reports`, `created_by`, `updated_by`, `is_details`, `is_fixed_assets`, `CategoryTxt`, `Unit_description`) VALUES
('17792', 1, 'عهدة سيارة الحركة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('18649', 1, 'احمد العسبلي / حي الاندلس', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('19452', 1, 'مصروف ايجار معمل حي الاندلس', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('19635', 1, 'مصروفات حافظه حرارية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('19659', 1, 'مصروفات التوابل', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', ''),
('19883', 1, 'الحاج حمد / ماندو جنزور', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('20132', 1, 'مصروفات الحوم السلامي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'صندوق / قطعة'),
('20780', 1, 'مكافأت', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('21115', 1, 'ايجار الشقق السكنية المستحقة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('21548', 1, 'المبيعات', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('21981', 1, 'مصروفات الوقود', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'محروقات', 'لتر'),
('22611', 1, 'مصروف استخراج شهادات صحية', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('22922', 1, 'مصروفات التشغيل/رئيسي', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('23371', 1, 'صحون فلوكة صغيرة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('23662', 1, 'مرتب عبدالباري', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('23703', 1, 'مرتب احمد النيجري', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('24214', 1, 'مصروفات حلقات البصل', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'صندوق'),
('25049', 1, 'مصروف ايجار الشقق السكنية', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('25621', 1, 'مرتب احمد البحيري', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('25769', 1, 'مصروفات نقل القمامة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('26075', 1, 'مصروف العلاج', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('26410', 1, 'مصروف اعاشة عمال', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('26936', 1, 'مصروفات خبز التورتيلا', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'خبز', 'صندوق'),
('27027', 1, 'ايجار الثلاجة الرئيسية', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('27898', 1, 'سفر ومبيت', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, '', NULL),
('28303', 1, 'مصروفات كبدة الخروف', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('28658', 1, 'مصروفات الحطب', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'محروقات', 'حزمة'),
('28822', 1, 'مستلزمات سكن الموظفين', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('28829', 1, 'مصروفات تبلة المشاوي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'كيلو'),
('29485', 1, 'ايرادات اخرى', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('29598', 1, 'مصروف اشتراك انتر نت', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('30322', 1, 'مصروف وقود مقدم', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('30787', 1, 'مصروفات الخدمات', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('31222', 1, 'مصروفات اللحوم الحمراء بقر كو ستيليا', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('31528', 1, 'شركة بيليزا / حي الاندلس', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('31797', 1, 'مصروف مستلزمات طبية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('31804', 1, 'مصروفات خبزة الشاورما', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'خبز', 'فردة'),
('32759', 1, 'مصروفات النقل', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', 'نقلة'),
('32963', 1, 'مصروفات الجبنة المبشورة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'كجم'),
('33967', 1, 'عمولة ايجار سكن', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('34077', 1, 'مصروف العسل الطبيعي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'كيلو'),
('34696', 1, 'مصروفات اخري', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('36341', 1, 'عمولة شركة وقتي', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('36393', 1, 'مصروفات الدقيق', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'شوال / دستة'),
('38204', 1, 'حامد الشويهدي / ماندو الجرابة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('39461', 1, 'الايرادات', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('39756', 1, 'مصروف علب بطاطا مفتوحة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('39953', 1, 'تكاليف تأسيس مطعم جنزور', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('39957', 1, 'مصروف بريد وهاتف وبرق', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('40340', 1, 'المستثمر - الحاج نوري', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('40478', 1, 'مصروفات تخليص الشحن والجمرك', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('40781', 1, 'حامد الشويهدي / ماندو جنزور', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('41006', 1, 'صحون فلوكة متوسطة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('41703', 1, 'إجراءات رخصة مطعم', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('41864', 1, 'صحون سلفر كيلو', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('42043', 1, 'نسبة توصيل شركة بريستو', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('42218', 1, 'حامد الشويهدي - ماندو تقسيم', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('42470', 1, 'مصروفات مواصلات عمال', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('43304', 1, 'مصروفات المرتبات مستحقة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('43723', 1, 'مرتب علي الزوي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('44211', 1, 'مصروف دعاية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('44322', 1, 'مصروف ايجار مقدم', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('44728', 1, 'تصنيع ستائر', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('45003', 1, 'تكاليف تأسيس ماندو الجرابة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('45360', 1, 'مصروف ايجار المطعم', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('45696', 1, 'مصروفات اللحوم الحمراء بقر هبرة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('46331', 1, 'مصروف تغليفات ورق الطاولة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('47016', 1, 'مصروفات المشروبات والمياه', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, '', 'صندوق'),
('47765', 1, 'مرتب محمد الورفلي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, '', NULL),
('48559', 1, 'مصروف الاتعاب المهنية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('50380', 1, 'ايجار مطعم مستحق', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('51211', 1, 'مصروفات الخل', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'صندوق'),
('51328', 1, 'مرتب اشرف الطراح', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, '', NULL),
('53073', 1, 'صحون فلوكة كبيرة كيلو', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('53331', 1, 'الحاج حمد زغبية ماندو تقسيم', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('54163', 1, 'حافضة حرارية مقسم ثلاثي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('54241', 1, 'خسائر طلبيات ملغية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('54307', 1, 'مخالفة للحرس البلدي', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('54523', 1, 'الحاج نوري زعبية /الانيا جنزور', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('55438', 1, 'المصروفات', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('55807', 1, 'مصروفات السنامة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كيلو'),
('56025', 1, 'كبة لحم مقلية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'قطعة'),
('56280', 1, 'عمولة شركة بريستو', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('56286', 1, 'مرتب مهند المانع', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('56476', 1, 'ديون المطبخ المركزي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, '', NULL),
('56778', 1, 'دبابات ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('56882', 1, 'خالد الشبيعان / الانيا نادي الرمال', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('57220', 1, 'مصروفات اللحوم البيضاء صدر الدجاج', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('57306', 1, 'عهدة المشتريات', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('57837', 1, 'فريز بابين - شكل ثلاجة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, '', NULL),
('57993', 1, 'صحون سلفر نصف كبلو', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('58834', 1, 'ايراد بيع لحوم مصنعة/جاهزة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'لحوم', NULL),
('59176', 1, 'مصروف عمال مناولة وتنظيف', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('60013', 1, 'مصروف اكياس المبيعات', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'كجم'),
('60064', 1, 'مصروفات إدارية / رئيسي', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('60267', 1, 'مصروفات الغاز ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'محروقات', 'اسطوانة'),
('60678', 1, 'اعلان ممول', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('60725', 1, 'حامد الشويهدي / الانيا جنزور', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('60791', 1, 'حامد الشويهدي / الانيا النوفليين', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('61472', 1, 'اصول', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, '', NULL),
('61492', 1, 'عجز الخزينة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('61978', 1, 'مصروف علب استربس ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('62887', 1, 'مصروف البطاطا', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'صندوق'),
('63039', 1, 'مصروفات شحن مواد', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('63387', 1, 'مرتب الحاج جلال المغربي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL);
        ");echo '55555555';


        DB::statement("
                            INSERT INTO accounts (`code`, `company_id`, `name`, `category_id`, `Parent_ID`, `classification_id`, `order`, `active`, `archived`, `is_used_in_reports`, `created_by`, `updated_by`, `is_details`, `is_fixed_assets`, `CategoryTxt`, `Unit_description`) VALUES
('63524', 1, 'مصروف تغليفات الشركة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('63697', 1, 'مرتب عبدالحكيم القماطي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('64189', 1, 'تكاليف تأسيس الانيا النوفليين', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('65275', 1, 'تكاليف تأسيس ماندو حي الاندلس', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('65435', 1, 'عهدة كاسة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('65700', 1, 'مرتب ابراهيم النيجري', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('66474', 1, 'تكاليف تركيب مكيفات', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('66747', 1, 'مصروفات صوص تكساس', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'كجم'),
('67273', 1, 'حساب الخسائر', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('67513', 1, 'مصاريف استجلاب عمالة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('68155', 1, 'إجراءات تسجيل الشركة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, '', NULL),
('68269', 1, 'مرتب حامد الشويهدي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('69539', 1, 'مصروفات الاقامة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('71308', 1, 'ايجار المعمل', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('71512', 1, 'جلسة تصوير اصناف الوجبات', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('71780', 1, 'المرتبات', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('71907', 1, 'مصروف الكهرباء والديزل ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('72026', 1, 'فائض الخزينة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('73539', 1, 'صحون سلفر ربع كيلو', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('73712', 1, 'أل الريشي', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('74636', 1, 'المستثمر علاء الفاضلي', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('74835', 1, 'مصروفات زيت الزيتون', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'لتر'),
('75491', 1, 'حامد الشويهدي / المعمل المركزي', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('75826', 1, 'دين التغليفات العامة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('76036', 1, 'شركة العامة للمياه والصرف الصحي ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, '', NULL),
('76306', 1, 'مصروفات الزيت', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'صندوق / شيشة'),
('76783', 1, 'مصروفات صيانة المولد ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, '', NULL),
('76996', 1, 'مصروف صيانة السيارات', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('77136', 1, 'مصروف صيانة وتوسعة الانيا النوفليين', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('77552', 1, 'مصروف مكافحة الافات', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('78553', 1, 'مصروفات اللحوم البيضاء شاورما ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('78814', 1, 'مصروف ايجار المطبخ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('79571', 1, 'مرتب ربيع الشطشاط', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('80160', 1, 'حامد السويهدي / معمل حي الاندلس', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('80319', 1, 'مصروف اعانة اجتماعية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, '', NULL),
('81283', 1, 'مرتب محمد بالراس علي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('81546', 1, 'مصطفى البعجة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('82850', 1, 'مصروفات ستارة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('83338', 1, 'صيانة الشقق السكنية', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('83390', 1, 'مصروفات مناديل المائدة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'دستة'),
('84357', 1, 'مصروف تجديد اشتراك بين اسبورت', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('84755', 1, 'مصاريف الافتتاح التجريبي', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('84805', 1, 'مرتب محمد المنفي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('84850', 1, 'مصروفات الملابس', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('85360', 1, 'دين لمطعم الانيا جنزور', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('86486', 1, 'تعزية', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', ''),
('87810', 1, 'مرتب فوزي سعيد عمر', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('87871', 1, 'مصروف ايجار سيارة', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('89053', 1, 'احتفالات وترفية', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('89678', 1, 'مرتب وليد التركي', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('90561', 1, 'الشريك - حامد الشويهدي', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, NULL, NULL),
('90868', 1, 'مصروفات المايونيز', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'صندوق / جالون'),
('91225', 1, 'مصروفات صيانة الالات', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('91327', 1, 'مصروفات اللحوم البيضاء دجاج بالعظم', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'صندوق'),
('91508', 1, 'مصروفات السلفر', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('91905', 1, 'مصروفات التغليفات العامة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', ''),
('92162', 1, 'مرتب عبدالرزاق البدري', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('93407', 1, 'مصروفات صوص سموكي ', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', 'كجم'),
('93844', 1, 'اصول ثابتة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, '', NULL),
('94237', 1, 'تغليفات الشركة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, NULL, NULL),
('94267', 1, 'مصروفات اللحوم الحمراء بقر كونترا فلية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('94708', 1, 'مخالفة إدارية للاوائح المول', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('95174', 1, 'تكاليف الصيانة الجوهرية', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, '', NULL),
('95447', 1, 'مصروفات الخضروات', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'خضروات', ''),
('96569', 1, 'مصروف علب بطاطا', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'تغليفات', 'قطعة'),
('96820', 1, 'مصروفات القرطاسية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('98504', 1, 'مصروفات نقل القمامة0', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('98872', 1, 'مصروفات الصيانة العامة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'أخرى', ''),
('99473', 1, 'مصروفات اللحوم الحمراء بقر فيليه', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('99523', 1, 'مصروفات الكبدة', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'لحوم', 'كجم'),
('99637', 1, 'تبرعات', 5, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 'أخرى', ''),
('99942', 1, 'مصروفات المواد الغذائية', 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 'غذائية', NULL);
        ");echo '55555555';














//        dd(\App\TempAccount::all());
//        DB::table('accounts')->insert([
//            'code'=>'22aa'
//            ,'name'=> '$tbl->name'
//            ,'company_id'=>1
//            ,'category_id'=> 1
//            ,'parent_id'=> 0
//            ,'classification_id'=> 1
//            ,'order'=> 1
//            ,'active'=> 1
//            ,'archived'=> 0
//            ,'is_fixed_assets'=> 0
//            ,'is_details'=> 0
//            ,'is_used_in_reports'=> 0
//
//            ,'CategoryTxt'=> '$tbl->CategoryTxt'
//            ,'Unit_description'=> '$tbl->Unit_description'
//
//            ,'created_by'=>1
//            ,'updated_by'=>1
//        ]);
//        dd(DB::table('acc_temp')->select('*')->get());
//echo '222222';
//        $acc_table = DB::table('acc_temp')->select('*')->get();
//        dd($acc_table);
//        $code = 2001;
//        foreach ( $acc_table as $tbl){
//            DB::table('accounts')->insert([
//                'code'=>$code
//                ,'name'=> $tbl->name
//                ,'company_id'=>1
//                ,'category_id'=> $tbl->category_id
//                ,'parent_id'=> 0
//                ,'classification_id'=> $tbl->classification_id
//                ,'order'=> $code
//                ,'active'=> 1
//                ,'archived'=> 0
//                ,'is_fixed_assets'=> $tbl->classification_id
//                ,'is_details'=> $tbl->is_details
//                ,'is_used_in_reports'=> $tbl->is_used_in_reports
//
//                ,'CategoryTxt'=> $tbl->CategoryTxt
//                ,'Unit_description'=> $tbl->Unit_description
//
//                ,'created_by'=>1
//                ,'updated_by'=>1
//            ]);
//            $code++;
//        }
    }
}
